# Quiz 3

**Author:**

**Exercise 1:** 

1. Import the nobel price data frame using pandas.

2. Explore the data set: 

    2.1. Print the first five rows of the table.

    2.2. Print all the columns in the table.

    2.3. Print the types of all the columns in the table.

    2.4. Would the describe function give us any useful information of this data? (answer based on the data types of the columns).

3. Select only the gender column. Using a lambda function and the filter function, calculate the number and proportion of woman who have won the nobel price.

4. Select the column gender and save it in an object called ```g```. Do the same with the column category, and save it in an object called ```c```. Create a new object ```gc = g + c``` and print the content. 

5. Use the object ```gc```, a lambda function and the filter function to calculate the number and proportion of females that have won the economics novel price. Compare that number with the total number of females that have won any nobel price (from question 3)

In [1]:
import pandas as pd

In [7]:
import os
os.getcwd()
np = pd.read_csv('data/nobel_prize.csv')

In [8]:
np.head()

,index,id,firstname,surname,born,died,bornCountry,bornCountryCode,bornCity,diedCountry,...,diedCity,gender,year,category,overallMotivation,share,motivation,name,city,country
0,0,846,Elinor,Ostrom,8/7/1933,6/12/2012,USA,US,"Los Angeles, CA",USA,...,"Bloomington, IN",female,2009.0,economics,NaN,2.0,"""for her analysis of economic governance, espe...",Indiana University,"Bloomington, IN",USA
1,1,846,Elinor,Ostrom,8/7/1933,6/12/2012,USA,US,"Los Angeles, CA",USA,...,"Bloomington, IN",female,2009.0,economics,NaN,2.0,"""for her analysis of economic governance, espe...",Arizona State University,"Tempe, AZ",USA
2,2,783,Wangari Muta,Maathai,4/1/1940,9/25/2011,Kenya,KE,Nyeri,Kenya,...,Nairobi,female,2004.0,peace,NaN,1.0,"""for her contribution to sustainable developme...",NaN,NaN,NaN
3,3,230,Dorothy Crowfoot,Hodgkin,5/12/1910,7/29/1994,Egypt,EG,Cairo,United Kingdom,...,Shipston-on-Stour,female,1964.0,chemistry,NaN,1.0,"""for her determinations by X-ray techniques of...","University of Oxford, Royal Society",Oxford,United Kingdom
4,4,918,Youyou,Tu,12/30/1930,0000-00-00,China,CN,Zhejiang Ningbo,NaN,...,NaN,female,2015.0,medicine,NaN,2.0,"""for her discoveries concerning a novel therap...",China Academy of Traditional Chinese Medicine,Beijing,China

In [12]:
np.columns

Index(['index', 'id', 'firstname', 'surname', 'born', 'died', 'bornCountry',
       'bornCountryCode', 'bornCity', 'diedCountry', 'diedCountryCode',
       'diedCity', 'gender', 'year', 'category', 'overallMotivation', 'share',
       'motivation', 'name', 'city', 'country'],
      dtype='object')

In [16]:
np.dtypes

index                  int64
id                     int64
firstname             object
surname               object
born                  object
died                  object
bornCountry           object
bornCountryCode       object
bornCity              object
diedCountry           object
diedCountryCode       object
diedCity              object
gender                object
year                 float64
category              object
overallMotivation     object
share                float64
motivation            object
name                  object
city                  object
country               object
dtype: object

In [27]:
np.describe()

            index          id         year       share
count  972.000000  972.000000   966.000000  966.000000
mean   485.500000  471.365226  1970.145963    2.005176
std    280.736531  275.012711    32.889742    0.930193
min      0.000000    1.000000  1901.000000    1.000000
25%    242.750000  230.750000  1947.000000    1.000000
50%    485.500000  463.500000  1976.000000    2.000000
75%    728.250000  720.250000  1999.000000    3.000000
max    971.000000  934.000000  2016.000000    4.000000


#I don't think this is relevant information because we are looking at varibles like year and index and id etc, all of these statistics don't tell us anything relevant about the data. For example, the mean of the ID is not important because that number doesn't represent anything meaningful. Although variables like year and ID are numbers, their std or mean do not tell us relevant information about the data.

In [22]:
g = np['gender']

women = list(filter(lambda x: x == "female", g))
men = list(filter(lambda x: x == "male", g))
len(women) #50 women
print(len(women)/(len(men)+len(women)))  #amount of women who win out of total amount

0.052854122621564484

In [26]:
g = np['gender']
c = np['category']
gc = g+c
print(gc)

0      femaleeconomics
1      femaleeconomics
2          femalepeace
3      femalechemistry
4       femalemedicine
            ...
967           orgpeace
968           orgpeace
969           orgpeace
970           orgpeace
971           orgpeace
Length: 972, dtype: object

In [31]:
womenEcon = list(filter(lambda x: x == "femaleeconomics", gc))
len(womenEcon)

2

Women who won the female economics nobel peace prize is 2. The total amount of women who have won nobel peace prizes are 50.